Охотники_и_рыболовы/src/Documents/Заявление/Заявление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявление</name>
  <basedOn>Document.РазрешениеНаОхоту</basedOn>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазрешениеНаОхоту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Охотники_и_рыболовы/src/Documents/Заявление/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Заявление = ОхотаСервер.НайтиПодчиненноеЗаявление(ДокументОснование.Ссылка);
	
	Если ЗначениеЗаполнено(Заявление)
		И Заявление.Ссылка <> Ссылка Тогда
		
		ТекстСообщения = НСтр(
			"ru = 'Для документа ""%Ссылка%"" 
			|уже введена путевка ""%Заявление%"".
			|Запись еще одного документа ""Заявление"" не допускается!'"
		);
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ДокументОснование.Ссылка);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Заявление%", Заявление);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;

	
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РазрешениеНаОхоту") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Проведен,Ссылка,Номер,Ответственный");
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры
